/***********************************************************************************************************************
**    作   者：    一小撮坏分子
**    功能描述：
**    创建日期：    2022-10-21
**    更新日期：    2022-10-21
***********************************************************************************************************************/
#ifndef OPENFMT_OPTION_PARSER_H
#define OPENFMT_OPTION_PARSER_H

#endif //OPENFMT_OPTION_PARSER_H

#include "proto.h"
#include "lib/queue.h"

PbOption *parse_option(char *line);