/***********************************************************************************************************************
**    作   者：    一小撮坏分子
**    功能描述：    general memory resource management functions
**    创建日期：    2023-05-17
**    更新日期：    2023-05-17
***********************************************************************************************************************/
#ifndef OPENFMT_MEMORY_H
#define OPENFMT_MEMORY_H

#include  <stdio.h>
#include  <stdlib.h>

/***********************************************************************************************************************
**    作   者：    一小撮坏分子
**    功能描述：    memory allocation with check.
**    参数列表：    size:   the size of memory to be allocated.
**                return: void pointer, if NULL, allocate failed with message printed.
**    创建日期：    2023-05-17
**    更新日期：    2023-05-17
***********************************************************************************************************************/
void *g_malloc(size_t size);

/***********************************************************************************************************************
**    作   者：    一小撮坏分子
**    功能描述：    free memory and set the target pointer to NULL.
**    参数列表：    ptr:    pointer to the target pointer, the memory pointed to by the target pointer will be freed.
**                return: None.
**    创建日期：    2023-05-17
**    更新日期：    2023-06-01
***********************************************************************************************************************/
void *g_free(void **ptr);

#endif //OPENFMT_MEMORY_H
